# SetDepthCueing Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..SetDepthCueing Method
View Class See Also
---
Sets the depth cueing settings for the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetDepthCueing(
	ViewDisplayDepthCueing depthCueing
)
```

Visual Basic
---
```text
Public Sub SetDepthCueing ( _
	depthCueing As ViewDisplayDepthCueing _
)
```

Visual C++
---
```text
public:
void SetDepthCueing(
	ViewDisplayDepthCueing^ depthCueing
)
```

# ### Parameters
depthCueing
    Type: Autodesk.Revit.DB..::..ViewDisplayDepthCueing Depth cueing settings to set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This view does not contain display-related properties. -or- This view cannot use Depth Cueing |

# See Also
View Class
Autodesk.Revit.DB Namespace